; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 416658 2 3 3 7 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Phenomenon7 spectrograph2)
	(have_image Star8 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 0 of 3
4. (turn_to satellite1 phenomenon7 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 0 of 3
7. (take_image satellite0 phenomenon7 instrument0 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 1 of 3
8. (turn_to satellite0 groundstation3 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 3
9. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 1 of 3
10. (take_image satellite0 star8 instrument0 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 2 of 3
11. (turn_to satellite0 groundstation3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 3
